nvme_bare_disk/iscsi_libaio_1024_randread_16k.log
iscsi_libaio_1024_randread_16k: (g=0): rw=randread, bs=(R) 16.0KiB-16.0KiB, (W) 16.0KiB-16.0KiB, (T) 16.0KiB-16.0KiB, ioengine=libaio, iodepth=1024
...
fio-3.1
Starting 64 processes

iscsi_libaio_1024_randread_16k: (groupid=0, jobs=64): err= 0: pid=776236: Tue Jul  7 00:12:57 2020
   read: IOPS=138k, BW=2154MiB/s (2259MB/s)(1262GiB/600068msec)
    slat (usec): min=8, max=1693.3k, avg=453.18, stdev=1075.92
    clat (msec): min=10, max=2618, avg=474.68, stdev=53.87
     lat (msec): min=10, max=2618, avg=475.13, stdev=53.90
    clat percentiles (msec):
     |  1.00th=[  426],  5.00th=[  443], 10.00th=[  451], 20.00th=[  456],
     | 30.00th=[  460], 40.00th=[  464], 50.00th=[  464], 60.00th=[  468],
     | 70.00th=[  472], 80.00th=[  477], 90.00th=[  502], 95.00th=[  558],
     | 99.00th=[  693], 99.50th=[  768], 99.90th=[  944], 99.95th=[ 1062],
     | 99.99th=[ 2089]
   bw (  KiB/s): min=  481, max=51711, per=1.57%, avg=34695.67, stdev=3070.27, samples=76738
   iops        : min=   30, max= 3231, avg=2168.07, stdev=191.89, samples=76738
  lat (msec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.03%, 500=89.72%
  lat (msec)   : 750=9.66%, 1000=0.51%, 2000=0.05%, >=2000=0.02%
  cpu          : usr=1.72%, sys=94.47%, ctx=623076, majf=0, minf=27097805
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=82732064,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
   READ: bw=2154MiB/s (2259MB/s), 2154MiB/s-2154MiB/s (2259MB/s-2259MB/s), io=1262GiB (1355GB), run=600068-600068msec

Disk stats (read/write):
  nvme1n1: ios=82719742/0, merge=0/0, ticks=2211450478/0, in_queue=2534074352, util=100.00%