nvme_bare_disk/iscsi_libaio_1024_randread_1m.log
iscsi_libaio_1024_randread_1m: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1024
...
fio-3.1
Starting 64 processes

iscsi_libaio_1024_randread_1m: (groupid=0, jobs=64): err= 0: pid=781732: Tue Jul  7 00:46:08 2020
   read: IOPS=1686, BW=1617MiB/s (1695MB/s)(951GiB/602469msec)
    slat (usec): min=44, max=50031k, avg=31327.14, stdev=330349.87
    clat (msec): min=1312, max=245809, avg=31368.17, stdev=29797.64
     lat (msec): min=1312, max=245822, avg=31399.49, stdev=29814.99
    clat percentiles (msec):
     |  1.00th=[ 4212],  5.00th=[ 9194], 10.00th=[12550], 20.00th=[17113],
     | 30.00th=[17113], 40.00th=[17113], 50.00th=[17113], 60.00th=[17113],
     | 70.00th=[17113], 80.00th=[17113], 90.00th=[17113], 95.00th=[17113],
     | 99.00th=[17113], 99.50th=[17113], 99.90th=[17113], 99.95th=[17113],
     | 99.99th=[17113]
   bw (  KiB/s): min=    9, max=601396, per=0.02%, avg=411.03, stdev=5270.34, samples=39917
   iops        : min=    0, max=  587, avg= 0.22, stdev= 5.14, samples=39917
  lat (msec)   : 2000=0.06%, >=2000=98.73%
  cpu          : usr=0.02%, sys=9.55%, ctx=267950, majf=6224, minf=70069934
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.2%, >=64=99.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=1016358,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1024

Run status group 0 (all jobs):
   READ: bw=1617MiB/s (1695MB/s), 1617MiB/s-1617MiB/s (1695MB/s-1695MB/s), io=951GiB (1021GB), run=602469-602469msec

Disk stats (read/write):
  nvme1n1: ios=1110702/0, merge=0/0, ticks=1939235491/0, in_queue=2011026820, util=87.29%